data comes from: https://www.workwithdata.com/dataset?col=city%2Ccity_coordinates%2Ccountry%2Cdomain%2Ctotal_students%2Cuniversity&entity=universities&f=1&fcol0=country&fop0=%3D&fval0=Germany

This is analysis of available universities in german cities

In [1]:
import pandas as pd
uni = pd.read_csv("Universities In Germany.csv")
uni.head()

,City,City coordinates,Country,Domain,Total students,University
0,Bielefeld,"[52.0333330, 8.5333330]",Germany,uni-bielefeld.de,25896.0,Bielefeld University
1,Brandenburg,"[52.4166670, 12.5500000]",Germany,b-tu.de,NaN,Brandenburg University of Technology
2,Oldenburg,"[53.1666670, 8.2000000]",Germany,uol.de,NaN,Carl von Ossietzky University of Oldenburg
3,Chemnitz,"[50.8333330, 12.9166670]",Germany,tu-chemnitz.de,NaN,Chemnitz University of Technology
4,Düsseldorf,"[51.2166670, 6.7666670]",Germany,kunstakademie-duesseldorf.de,NaN,Düsseldorf Art Academy

In [2]:
uni.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 72 entries, 0 to 71
Data columns (total 6 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   City              59 non-null     object
 1   City coordinates  59 non-null     object
 2   Country           72 non-null     object
 3   Domain            71 non-null     object
 4   Total students    40 non-null     float64
 5   University        72 non-null     object
dtypes: float64(1), object(5)
memory usage: 3.5+ KB

it seams like when ever the name of the city or coordinates are repeated it hase bean left empty space insted 
not sure why out of 72 row only 40 has number of student perhaps not provided

In [3]:
uni['City'] = uni['City'].fillna(method="ffill")#fills the name of the empty cities with the previous non empty one
uni.head()

/var/folders/pd/wynthhk510v_lw3l_4q234gh0000gn/T/ipykernel_97766/3621693225.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  uni['City'] = uni['City'].fillna(method="ffill")#fills the name of the empty cities with the previous non empty one

,City,City coordinates,Country,Domain,Total students,University
0,Bielefeld,"[52.0333330, 8.5333330]",Germany,uni-bielefeld.de,25896.0,Bielefeld University
1,Brandenburg,"[52.4166670, 12.5500000]",Germany,b-tu.de,NaN,Brandenburg University of Technology
2,Oldenburg,"[53.1666670, 8.2000000]",Germany,uol.de,NaN,Carl von Ossietzky University of Oldenburg
3,Chemnitz,"[50.8333330, 12.9166670]",Germany,tu-chemnitz.de,NaN,Chemnitz University of Technology
4,Düsseldorf,"[51.2166670, 6.7666670]",Germany,kunstakademie-duesseldorf.de,NaN,Düsseldorf Art Academy

to fill out missing values in Total students I am using method='linear' that uses linear interpolation to fill out the missing values.

Linear interpolation is a mathematical method that uses linear polynomials to create new data points between known data points.

In [4]:
test = uni.copy()
test['Total students'] = test['Total students'].interpolate(method='linear')
test.rename(columns={'City':'city'},inplace=True)
test.drop(columns=['City coordinates', 'Country', 'Domain'],inplace=True)
test.head()

          city  Total students                                  University
0    Bielefeld         25896.0                        Bielefeld University
1  Brandenburg         24360.6        Brandenburg University of Technology
2    Oldenburg         22825.2  Carl von Ossietzky University of Oldenburg
3     Chemnitz         21289.8           Chemnitz University of Technology
4   Düsseldorf         19754.4                      Düsseldorf Art Academy

In [5]:
test.to_csv('unvercities.csv',index=False)